Revit 2027 API
Material.SurfaceForegroundPatternColor Property
 The color of the material surface foreground pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Color SurfaceForegroundPatternColor { get; set; }
Public Property SurfaceForegroundPatternColor As Color
	Get
	Set
public:
property Color^ SurfaceForegroundPatternColor {
	Color^ get ();
	void set (Color^ value);
}
member SurfaceForegroundPatternColor : Color with get, set
Property Value
Color
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
Material Class
Autodesk.Revit.DB Namespace